In [1]:
import pandas as pd

In [4]:
df = pd.read_excel('/Users/kaitlincough/Documents/data_studio_projects_2017/data-studio-projects/code/immigration_enforcement/ENF 2013_0/2013_table34d.xls')

In [5]:
df.head()

,Table 34.,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10
0,ALIENS APPREHENDED BY REGION AND COUNTRY OF NA...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Region and country of nationality,2004,2005,2006,2007,2008 1,2009 2,2010,2011,2012,2013
3,REGION,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Total,1264232,1291065,1206412,960772,1043799,889203,796587,678606,671327,662483